# Используйте базовый образ node для Node.js
FROM node:14-alpine

# Установите рабочую директорию внутри контейнера
WORKDIR /app

# Скопируйте файлы package.json и package-lock.json
COPY package*.json ./

# Установите зависимости
RUN npm install

# Скопируйте все файлы проекта в рабочую директорию контейнера
COPY . .

# Соберите React приложение
RUN npm run build

# Установите сервер статических файлов для обслуживания собранного приложения
RUN npm install -g serve

# Укажите команду для запуска сервера статических файлов при запуске контейнера
CMD ["serve", "-s", "build"]

# Опционально, укажите порт, на котором будет доступно приложение
EXPOSE 5000
